<a href="https://colab.research.google.com/github/AnchitSharma/cuistomer-segmentation/blob/master/customer_segmentation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Data manipulation Libraries
import numpy as np
import pandas as pd
# Data Viz
import matplotlib.pyplot as plt
# Scikit-Learn ML Libraries
from sklearn.preprocessing import *
from sklearn.model_selection import *
from sklearn.metrics import *

In [2]:
# Boosting Algorithm Libraries
from xgboost import XGBClassifier
# from catboost import CatBoostClassifier
from lightgbm import LGBMClassifier
from sklearn.ensemble import RandomForestClassifier, VotingClassifier
from sklearn.metrics import accuracy_score
from sklearn.model_selection import StratifiedKFold, KFold

Load Data

https://www.kaggle.com/vetrirah/customer

In [3]:
train = pd.read_csv("https://raw.githubusercontent.com/AnchitSharma/cuistomer-segmentation/master/customers_data/Train.csv")
test = pd.read_csv("https://raw.githubusercontent.com/AnchitSharma/cuistomer-segmentation/master/customers_data/Test.csv")
sub = pd.read_csv("https://raw.githubusercontent.com/AnchitSharma/cuistomer-segmentation/master/customers_data/sample_submission.csv")

In [4]:
train.head()

       ID  Gender Ever_Married  ...  Family_Size  Var_1 Segmentation
0  462809    Male           No  ...          4.0  Cat_4            D
1  462643  Female          Yes  ...          3.0  Cat_4            A
2  466315  Female          Yes  ...          1.0  Cat_6            B
3  461735    Male          Yes  ...          2.0  Cat_6            B
4  462669  Female          Yes  ...          6.0  Cat_6            A

[5 rows x 11 columns]

Perform EDA (Exploratory Data Analysis) 

Explore Test and Train Data and get to know what each Column/Feature denotes

In [5]:
def display_data_information(data, data_types, dataframe_name):
  print("Information of ", dataframe_name, "Rows = ", data.shape[0], "| columns = ", data.shape[1], "\n")
  data.info()

  print("\n")
  for VARIABLE in data_types:
    data_type = data.select_dtypes(include=[ VARIABLE ]).dtypes

    if len(data_type) > 0:
      print(str(len(data_type)) + " "+VARIABLE+" Features\n"+str(data_type)+"\n" )


# Display Data Information of "train: :
data_types = ["float32", "float64", "int32", "int64", "object", "category", "datetime64[ns]"]
display_data_information(train, data_types, "train")

Information of  train Rows =  8068 | columns =  11

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8068 entries, 0 to 8067
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               8068 non-null   int64
 1   Gender           8068 non-null   object
 2   Ever_Married     7928 non-null   object
 3   Age              8068 non-null   int64
 4   Graduated        7990 non-null   object
 5   Profession       7944 non-null   object
 6   Work_Experience  7239 non-null   float64
 7   Spending_Score   8068 non-null   object
 8   Family_Size      7733 non-null   float64
 9   Var_1            7992 non-null   object
 10  Segmentation     8068 non-null   object
dtypes: float64(2), int64(2), object(7)
memory usage: 693.5+ KB


2 float64 Features
Work_Experience    float64
Family_Size        float64
dtype: object

2 int64 Features
ID     int64
Age    int64
dtype: object

7 object Features
Gender            object
Ever_Married      object
Graduated         object
Profession        object
Spending_Score    object
Var_1             object
Segmentation      object
dtype: object

In [6]:
# train.select_dtypes(include=["float64"]).dtypes
display_data_information(test, data_types, "test")

Information of  test Rows =  2627 | columns =  10

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2627 entries, 0 to 2626
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               2627 non-null   int64
 1   Gender           2627 non-null   object
 2   Ever_Married     2577 non-null   object
 3   Age              2627 non-null   int64
 4   Graduated        2603 non-null   object
 5   Profession       2589 non-null   object
 6   Work_Experience  2358 non-null   float64
 7   Spending_Score   2627 non-null   object
 8   Family_Size      2514 non-null   float64
 9   Var_1            2595 non-null   object
dtypes: float64(2), int64(2), object(6)
memory usage: 205.4+ KB


2 float64 Features
Work_Experience    float64
Family_Size        float64
dtype: object

2 int64 Features
ID     int64
Age    int64
dtype: object

6 object Features
Gender            object
Ever_Married      object
Graduated         object
Profession        object
Spending_Score    object
Var_1             object
dtype: object

Display head and tail of the dataframe

In [7]:
def display_head_tail(data, head_rows, tail_rows):
  display("Data Head & Tail : ")
  display(data.head(head_rows).append(data.tail(tail_rows)))

display_head_tail(train, head_rows=3, tail_rows=2)

'Data Head & Tail : '

          ID  Gender Ever_Married  ...  Family_Size  Var_1 Segmentation
0     462809    Male           No  ...          4.0  Cat_4            D
1     462643  Female          Yes  ...          3.0  Cat_4            A
2     466315  Female          Yes  ...          1.0  Cat_6            B
8066  467299  Female           No  ...          4.0  Cat_6            B
8067  461879    Male          Yes  ...          3.0  Cat_4            B

[5 rows x 11 columns]

In [8]:
display_head_tail(test, head_rows=3, tail_rows=2)

'Data Head & Tail : '

          ID  Gender Ever_Married  ...  Spending_Score Family_Size  Var_1
0     458989  Female          Yes  ...             Low         1.0  Cat_6
1     458994    Male          Yes  ...         Average         4.0  Cat_6
2     458996  Female          Yes  ...             Low         1.0  Cat_6
2625  467961    Male          Yes  ...            High         5.0  Cat_4
2626  467968  Female           No  ...             Low         3.0  Cat_7

[5 rows x 10 columns]

In [9]:
def display_data_description(data, numeric_data_types, categorical_data_type):
  print(" Data Description ")
  display(data.describe(include =  numeric_data_types))
  print(" ")
  display(data.describe(include = categorical_data_type))

In [10]:
display_data_description(train, data_types[0:4], data_types[4:7])

 Data Description

                  ID          Age  Work_Experience  Family_Size
count    8068.000000  8068.000000      7239.000000  7733.000000
mean   463479.214551    43.466906         2.641663     2.850123
std      2595.381232    16.711696         3.406763     1.531413
min    458982.000000    18.000000         0.000000     1.000000
25%    461240.750000    30.000000         0.000000     2.000000
50%    463472.500000    40.000000         1.000000     3.000000
75%    465744.250000    53.000000         4.000000     4.000000
max    467974.000000    89.000000        14.000000     9.000000

       Gender Ever_Married Graduated  ... Spending_Score  Var_1 Segmentation
count    8068         7928      7990  ...           8068   7992         8068
unique      2            2         2  ...              3      7            4
top      Male          Yes       Yes  ...            Low  Cat_6            D
freq     4417         4643      4968  ...           4878   5238         2268

[4 rows x 7 columns]

In [11]:
display_data_description(test, data_types[0:4], data_types[4:7])

 Data Description

                  ID          Age  Work_Experience  Family_Size
count    2627.000000  2627.000000      2358.000000  2514.000000
mean   463433.918919    43.649791         2.552587     2.825378
std      2618.245698    16.967015         3.341094     1.551906
min    458989.000000    18.000000         0.000000     1.000000
25%    461162.500000    30.000000         0.000000     2.000000
50%    463379.000000    41.000000         1.000000     2.000000
75%    465696.000000    53.000000         4.000000     4.000000
max    467968.000000    89.000000        14.000000     9.000000

       Gender Ever_Married Graduated Profession Spending_Score  Var_1
count    2627         2577      2603       2589           2627   2595
unique      2            2         2          9              3      7
top      Male          Yes       Yes     Artist            Low  Cat_6
freq     1424         1520      1602        802           1616   1672

In [12]:
# Checking Percentage of common ID's between train and test data using Unique train values

print(np.intersect1d(train['ID'], test['ID']).shape[0]/train['ID'].nunique())

common_ids = len(
    set(test['ID'].unique()).intersection(set(train['ID'].unique()))
    )

print("Common IDs : ", common_ids)

# Data Leak as out of 2627 Rows , there are 2332 ID's in common

print("Unique IDs : ", test.shape[0] - common_ids)

0.2890431333663857
Common IDs :  2332
Unique IDs :  295

In [14]:
set(test['ID'].unique()).intersection?

Object `intersection` not found.

In [13]:
testx = pd.merge(test, train, how="left", on="ID")

Remove Duplicate Rows from Train data if present

In [15]:
def remove_duplicates(data):
  print("BEFORE REMOVING DUPLICATES - No of Rows : ", data.shape[0])
  data.drop_duplicates(keep="first", inplace=True)
  print("AFTER REMOVING DUPLICATES  - No of Rows : ", data.shape[0])

  return data

In [16]:
train = remove_duplicates(train)

BEFORE REMOVING DUPLICATES - No of Rows :  8068
AFTER REMOVING DUPLICATES  - No of Rows :  8068

Fill/Impute Missing values continuous - Mean/Median/Any specific value

& categorical - Others/ForwardFill/BackFill

In [17]:
# Let LightGBM classifier Handles the issues

In [18]:
def display_unique(data):

  for column in data.columns:
    print("No of Unique values in "+column+" Column are : "+str(data[column].nunique()) )# nunique gives count of unique values
    print("Actual Unique Values in "+column+" Column are : "+str(data[column].sort_values(ascending=True, na_position="last").unique()))

    print("NULL Values : ")
    print(data[ column ].isnull().sum())
    print("Value counts : ")
    print(data[column].value_counts())
    print(" ")

In [19]:
display_unique(train)

No of Unique values in ID Column are : 8068
Actual Unique Values in ID Column are : [458982 458983 458984 ... 467972 467973 467974]
NULL Values :
0
Value counts :
460799    1
466217    1
460042    1
462091    1
464144    1
         ..
463511    1
467609    1
461468    1
459421    1
460801    1
Name: ID, Length: 8068, dtype: int64

No of Unique values in Gender Column are : 2
Actual Unique Values in Gender Column are : ['Female' 'Male']
NULL Values :
0
Value counts :
Male      4417
Female    3651
Name: Gender, dtype: int64

No of Unique values in Ever_Married Column are : 2
Actual Unique Values in Ever_Married Column are : ['No' 'Yes' nan]
NULL Values :
140
Value counts :
Yes    4643
No     3285
Name: Ever_Married, dtype: int64

No of Unique values in Age Column are : 67
Actual Unique Values in Age Column are : [18 19 20 21 22 23 25 26 27 28 29 30 31 32 33 35 36 37 38 39 40 41 42 43
 45 46 47 48 49 50 51 52 53 55 56 57 58 59 60 61 62 63 65 66 67 68 69 70
 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89]
NULL Values :
0
Value counts :
35    250
37    234
33    232
42    232
27    229
     ...
78     29
87     28
76     27
80     24
85     22
Name: Age, Length: 67, dtype: int64

No of Unique values in Graduated Column are : 2
Actual Unique Values in Graduated Column are : ['No' 'Yes' nan]
NULL Values :
78
Value counts :
Yes    4968
No     3022
Name: Graduated, dtype: int64

No of Unique values in Profession Column are : 9
Actual Unique Values in Profession Column are : ['Artist' 'Doctor' 'Engineer' 'Entertainment' 'Executive' 'Healthcare'
 'Homemaker' 'Lawyer' 'Marketing' nan]
NULL Values :
124
Value counts :
Artist           2516
Healthcare       1332
Entertainment     949
Engineer          699
Doctor            688
Lawyer            623
Executive         599
Marketing         292
Homemaker         246
Name: Profession, dtype: int64

No of Unique values in Work_Experience Column are : 15
Actual Unique Values in Work_Experience Column are : [ 0.  1.  2.  3.  4.  5.  6.  7.  8.  9. 10. 11. 12. 13. 14. nan]
NULL Values :
829
Value counts :
1.0     2354
0.0     2318
9.0      474
8.0      463
2.0      286
3.0      255
4.0      253
6.0      204
7.0      196
5.0      194
10.0      53
11.0      50
12.0      48
13.0      46
14.0      45
Name: Work_Experience, dtype: int64

No of Unique values in Spending_Score Column are : 3
Actual Unique Values in Spending_Score Column are : ['Average' 'High' 'Low']
NULL Values :
0
Value counts :
Low        4878
Average    1974
High       1216
Name: Spending_Score, dtype: int64

No of Unique values in Family_Size Column are : 9
Actual Unique Values in Family_Size Column are : [ 1.  2.  3.  4.  5.  6.  7.  8.  9. nan]
NULL Values :
335
Value counts :
2.0    2390
3.0    1497
1.0    1453
4.0    1379
5.0     612
6.0     212
7.0      96
8.0      50
9.0      44
Name: Family_Size, dtype: int64

No of Unique values in Var_1 Column are : 7
Actual Unique Values in Var_1 Column are : ['Cat_1' 'Cat_2' 'Cat_3' 'Cat_4' 'Cat_5' 'Cat_6' 'Cat_7' nan]
NULL Values :
76
Value counts :
Cat_6    5238
Cat_4    1089
Cat_3     822
Cat_2     422
Cat_7     203
Cat_1     133
Cat_5      85
Name: Var_1, dtype: int64

No of Unique values in Segmentation Column are : 4
Actual Unique Values in Segmentation Column are : ['A' 'B' 'C' 'D']
NULL Values :
0
Value counts :
D    2268
A    1972
C    1970
B    1858
Name: Segmentation, dtype: int64

In [20]:
for i in train:
  print(f"column {i} unique values {train[i].unique()}")

column ID unique values [462809 462643 466315 ... 465406 467299 461879]
column Gender unique values ['Male' 'Female']
column Ever_Married unique values ['No' 'Yes' nan]
column Age unique values [22 38 67 40 56 32 33 61 55 26 19 70 58 41 31 79 49 18 36 35 45 42 83 27
 28 47 29 57 76 25 72 48 74 59 39 51 30 63 52 60 68 86 50 43 80 37 46 69
 78 71 82 23 20 85 21 53 62 75 65 89 66 73 77 87 84 81 88]
column Graduated unique values ['No' 'Yes' nan]
column Profession unique values ['Healthcare' 'Engineer' 'Lawyer' 'Entertainment' 'Artist' 'Executive'
 'Doctor' 'Homemaker' 'Marketing' nan]
column Work_Experience unique values [ 1. nan  0.  4.  9. 12.  3. 13.  5.  8. 14.  7.  2.  6. 10. 11.]
column Spending_Score unique values ['Low' 'Average' 'High']
column Family_Size unique values [ 4.  3.  1.  2.  6. nan  5.  8.  7.  9.]
column Var_1 unique values ['Cat_4' 'Cat_6' 'Cat_7' 'Cat_3' 'Cat_1' 'Cat_2' nan 'Cat_5']
column Segmentation unique values ['D' 'A' 'B' 'C']

Multi class classification problem - Target has more than 2 categories

Target - Segmentation has 4 values of customers ['D', 'A', 'B', 'C']

# Feature Engineering

Feature Selection - Selection of most important existing features

Feature Creation - Creation of New Features from the Existing Features/ Predictors :

In [21]:
# concatenate train and test data into single dataframe

train["is_train"] = 1
test["is_train"] = 0
df = pd.concat([train, test])

In [22]:
df.columns

Index(['ID', 'Gender', 'Ever_Married', 'Age', 'Graduated', 'Profession',
       'Work_Experience', 'Spending_Score', 'Family_Size', 'Var_1',
       'Segmentation', 'is_train'],
      dtype='object')

In [23]:
# Label Encode Technique

from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

for i in ["Gender", "Ever_Married", "Graduated", "Profession", "Spending_Score", "Var_1"]:
  df[i] = le.fit_transform(df[i].astype('str'))

In [24]:
df.head()

       ID  Gender  Ever_Married  Age  ...  Family_Size  Var_1  Segmentation  is_train
0  462809       1             0   22  ...          4.0      3             D         1
1  462643       0             1   38  ...          3.0      3             A         1
2  466315       0             1   67  ...          1.0      5             B         1
3  461735       1             1   67  ...          2.0      5             B         1
4  462669       0             1   40  ...          6.0      5             A         1

[5 rows x 12 columns]

In [25]:
df['Segmentation'] = df['Segmentation'].map({'A':0, 'B':1, 'C':2, 'D':3})

Handle missing values

* Family_Size , Work_Experience

In [26]:
df['Family_Size'].isna().sum()#.value_counts()
df['Family_Size'].value_counts()
# fill the na values with 2.0 a minimum family is 2
df['Family_Size'] = df['Family_Size'].fillna(2)

In [27]:
df['Work_Experience'].isna().sum()
df['Work_Experience'].value_counts()
# filling na values with 0.0 default Work_Experience
df['Work_Experience'] = df['Work_Experience'].fillna(0)

In [28]:
df['Work_Experience'].isna().sum()

0

In [29]:
NA_list=df.isna().any()[lambda x: x]

In [30]:
NA_list

Segmentation    True
dtype: bool

In [31]:
# Get back train data from df

train = df[df['is_train'] == 1]
test = df[df['is_train'] == 0]

Split Train Data into Train and Validation Data with

Predictors(Independent) & Target(Dependent)

In [32]:
predictor_train = train.drop(['Segmentation', 'is_train', 'ID'], axis=1)
target_train = train['Segmentation']

In [33]:
predictor_test = test.drop(['Segmentation', 'is_train', 'ID'], axis=1)

In [35]:
predictor_train.head()

   Gender  Ever_Married  Age  ...  Spending_Score  Family_Size  Var_1
0       1             0   22  ...               2          4.0      3
1       0             1   38  ...               0          3.0      3
2       0             1   67  ...               2          1.0      5
3       1             1   67  ...               1          2.0      5
4       0             1   40  ...               1          6.0      5

[5 rows x 9 columns]

In [34]:
predictor_test.head()

   Gender  Ever_Married  Age  ...  Spending_Score  Family_Size  Var_1
0       0             1   36  ...               2          1.0      5
1       1             1   37  ...               0          4.0      5
2       0             1   69  ...               2          1.0      5
3       1             1   59  ...               1          2.0      5
4       0             0   19  ...               2          4.0      5

[5 rows x 9 columns]



















































































































































































































































































































## Create baseline ML model

In [36]:
categorical_features = ["Gender", "Ever_Married" ,"Graduated" ,"Profession" ,"Spending_Score" ,"Var_1" ]

lgb_model = LGBMClassifier()

# Apply stratified K-Fold cross validation where K = 5 or n_splits=5

kf = StratifiedKFold(n_splits=5, shuffle=True, random_state=10)
acc = []

# Pass predictor_train, target_train for Cross Validation
for fold, (t_id, v_id) in enumerate(kf.split(predictor_train, target_train)):

  # Split train and validation data
  tx = predictor_train.iloc[t_id]; ty = target_train.iloc[t_id]
  vx = predictor_train.iloc[v_id]; vy = target_train.iloc[v_id]


  # Train/Fit the data to LightGBM model
  lgb_model.fit(tx, ty, categorical_feature= categorical_features)
  
  # Predict the Validation  Data to Train LightGBM Model
  val_y = lgb_model.predict(vx)

  # Get Accuracy Score on validation data for each fold
  acc_score = accuracy_score(vy, val_y)
  acc.append(acc_score)
  print(f"fold {fold} accuracy {acc_score}")

print(f"Mean accuracy score {np.mean(acc)}")

/usr/local/lib/python3.6/dist-packages/lightgbm/basic.py:1209: UserWarning: categorical_feature in Dataset is overridden.
New categorical_feature is ['Ever_Married', 'Gender', 'Graduated', 'Profession', 'Spending_Score', 'Var_1']
  'New categorical_feature is {}'.format(sorted(list(categorical_feature))))

fold 0 accuracy 0.5272614622057001
fold 1 accuracy 0.5346964064436184
fold 2 accuracy 0.5198265179677819
fold 3 accuracy 0.5133292002479851
fold 4 accuracy 0.5517668939863608
Mean accuracy score 0.5293760961702892

## Improve ML Model, Fine Tune with MODEL Evaluation metric - "Accuracy" and Predict Target "Segmentation"

In [37]:
lgb_model = LGBMClassifier(
    boosting_type='gbdt',
    max_dept = 15,
    learning_rate=0.15,
    objective="multiclass",
    random_state=100,
    n_estimators=1000,
    reg_alpha=0,
    reg_lambda=1,
    n_jobs=-1
)

In [38]:
categorical_features = ["Gender", "Ever_Married" ,"Graduated" ,"Profession" ,"Spending_Score" ,"Var_1" ]

# lgb_model = LGBMClassifier()

# Apply stratified K-Fold cross validation where K = 5 or n_splits=5

kf = StratifiedKFold(n_splits=5, shuffle=True, random_state=10)
acc = []

# Pass predictor_train, target_train for Cross Validation
for fold, (t_id, v_id) in enumerate(kf.split(predictor_train, target_train)):

  # Split train and validation data
  tx = predictor_train.iloc[t_id]; ty = target_train.iloc[t_id]
  vx = predictor_train.iloc[v_id]; vy = target_train.iloc[v_id]


  # Train/Fit the data to LightGBM model
  lgb_model.fit(tx, ty, categorical_feature= categorical_features)
  
  # Predict the Validation  Data to Train LightGBM Model
  val_y = lgb_model.predict(vx)

  # Get Accuracy Score on validation data for each fold
  acc_score = accuracy_score(vy, val_y)
  acc.append(acc_score)
  print(f"fold {fold} accuracy {acc_score}")

print(f"Mean accuracy score {np.mean(acc)}")

/usr/local/lib/python3.6/dist-packages/lightgbm/basic.py:1209: UserWarning: categorical_feature in Dataset is overridden.
New categorical_feature is ['Ever_Married', 'Gender', 'Graduated', 'Profession', 'Spending_Score', 'Var_1']
  'New categorical_feature is {}'.format(sorted(list(categorical_feature))))

fold 0 accuracy 0.49070631970260226
fold 1 accuracy 0.49008674101610905
fold 2 accuracy 0.49070631970260226
fold 3 accuracy 0.47613143211407316
fold 4 accuracy 0.49659020458772474
Mean accuracy score 0.4888442034246223

In [41]:
lgb_model.n_features_

9

In [42]:
def model_train_predict_submit(Classifier_model_name, model_name, X_train, y_train, X_test, target):
  categorical_features = ["Gender", "Ever_Married" ,"Graduated" ,"Profession" ,"Spending_Score" ,"Var_1" ]
  Classifier_model_name.fit(X_train, y_train, categorical_feature = categorical_features)
  final_predictions = Classifier_model_name.predict(X_test)
  print(final_predictions)

  Result_Promoted = pd.DataFrame({'ID': sub['ID'], target : final_predictions})
  Result_Promoted[target] = Result_Promoted[ target ].map({0:"A", 1:"B", 2:"C", 3:"D"})
  print(Result_Promoted[ target ].unique())
  Result_Promoted.to_csv(model_name +"_Labelling=Yes_Scaling=Yes"+".csv", index=False)
  return Result_Promoted



model_name = "LGBM_Tuned_BEST"
model_classifier = lgb_model
sub = model_train_predict_submit(model_classifier, model_name, predictor_train, target_train, predictor_test, target="Segmentation")

/usr/local/lib/python3.6/dist-packages/lightgbm/basic.py:1209: UserWarning: categorical_feature in Dataset is overridden.
New categorical_feature is ['Ever_Married', 'Gender', 'Graduated', 'Profession', 'Spending_Score', 'Var_1']
  'New categorical_feature is {}'.format(sorted(list(categorical_feature))))

[1. 2. 0. ... 3. 2. 3.]
['B' 'C' 'A' 'D']

In [97]:
predictor_test.head()

   Gender  Ever_Married  Age  ...  Spending_Score  Family_Size  Var_1
0       0             1   36  ...               2          1.0      5
1       1             1   37  ...               0          4.0      5
2       0             1   69  ...               2          1.0      5
3       1             1   59  ...               1          2.0      5
4       0             0   19  ...               2          4.0      5

[5 rows x 9 columns]

In [98]:
predictor_train.head()

   index  Gender  Ever_Married  ...  Spending_Score  Family_Size  Var_1
0      0       1             0  ...               2          4.0      3
1      1       0             1  ...               0          3.0      3
2      2       0             1  ...               2          1.0      5
3      3       1             1  ...               1          2.0      5
4      4       0             1  ...               1          6.0      5

[5 rows x 10 columns]

In [93]:
lgb_model.n_features_

10